asscat-api/app/Controllers/AdminController.php

    public function approveResource($id = null)
    {
        $resourceModel = new ResourceModel();
        $resource = $resourceModel->find($id);

        if (!$resource) {
            return $this->failNotFound('Resource not found.');
        }

        $resourceModel->update($id, ['is_approved' => true]);
---
SELECT *
FROM `resources`
WHERE `resources`.`resource_id` = '7'
UPDATE `resources` SET `is_approved` = 1
WHERE `resources`.`resource_id` IN ('7')

    public function listAllResources()
    {
        $resourceModel = new ResourceModel();
        return $this->respond($resourceModel->findAll());
---
SELECT *
FROM `resources`

    public function listDepartments()
    {
        $deptModel = new \App\Models\DepartmentModel();
        return $this->respond($deptModel->findAll());
---
SELECT *
FROM `departments`