asscat-api/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'nulldev11@nullsec.null'
 LIMIT 1
---
    public function login() {
        $userModel = new UserModel();

        $json = $this->request->getJSON();
        $email = $json->email ?? '';
        $password = $json->password ?? '';

        $user = $userModel->where('email', $email)->first();