asscat-api/app/Controllers/CourseController.php

SELECT `resources`.*, `users`.`name` as `uploader_name`, `course_sections`.`section_name`, `courses`.`title` as `course_title`, `courses`.`dept_id`
FROM `resources`
LEFT JOIN `users` ON `users`.`user_id` = `resources`.`uploader_id`
LEFT JOIN `course_sections` ON `course_sections`.`section_id` = `resources`.`section_id`
LEFT JOIN `courses` ON `courses`.`course_id` = `course_sections`.`course_id`
WHERE `resources`.`is_approved` = 1
---
    public function index()
    {
        $resourceModel = new \App\Models\ResourceModel();
        $resources = $resourceModel
            ->select('resources.*, users.name as uploader_name, course_sections.section_name, courses.title as course_title, courses.dept_id')
            ->join('users', 'users.user_id = resources.uploader_id', 'left')
            ->join('course_sections', 'course_sections.section_id = resources.section_id', 'left')
            ->join('courses', 'courses.course_id = course_sections.course_id', 'left')
            ->where('resources.is_approved', true)
            ->findAll();

SELECT *
FROM `courses`
---
    public function all()
    {
        $courseModel = new CourseModel();
        return $this->respond($courseModel->findAll());

SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '1'
SELECT `resources`.*, `users`.`name` as `uploader_name`
FROM `resources`
LEFT JOIN `users` ON `users`.`user_id` = `resources`.`uploader_id`
WHERE `section_id` = '1'
AND `is_approved` = 1
---
    public function show($id = null)
    {
        $courseModel = new CourseModel();
        $course = $courseModel->find($id);

        if (!$course) {
            return $this->failNotFound('Course not found.');
        }

        $sectionModel = new \App\Models\SectionModel();
        $sections = $sectionModel->where('course_id', $course['course_id'])->findAll();

        $resourceModel = new \App\Models\ResourceModel();

        foreach ($sections as &$section) {
            $section['resources'] = $resourceModel
                ->select('resources.*, users.name as uploader_name')
                ->join('users', 'users.user_id = resources.uploader_id', 'left')
                ->where([
                    'section_id'  => $section['section_id'],
                    'is_approved' => true
                ])->findAll();

SELECT `resources`.*, `users`.`name` as `uploader_name`, `course_sections`.`section_name`, `courses`.`title` as `course_title`
FROM `resources`
LEFT JOIN `users` ON `users`.`user_id` = `resources`.`uploader_id`
LEFT JOIN `course_sections` ON `course_sections`.`section_id` = `resources`.`section_id`
LEFT JOIN `courses` ON `courses`.`course_id` = `course_sections`.`course_id`
WHERE `resources`.`resource_id` = '7'
---
    public function resourceDetail($id = null)
    {
        $resourceModel = new \App\Models\ResourceModel();
        $resource = $resourceModel
            ->select('resources.*, users.name as uploader_name, course_sections.section_name, courses.title as course_title')
            ->join('users', 'users.user_id = resources.uploader_id', 'left')
            ->join('course_sections', 'course_sections.section_id = resources.section_id', 'left')
            ->join('courses', 'courses.course_id = course_sections.course_id', 'left')
            ->find($id);