asscat-api/app/Controllers/Upload.php

SELECT *
FROM `resources`
WHERE `uploader_id` = '10'
---
    public function listMyResources() {
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        $token = explode(' ', $header)[1];
        $key = env('JWT_SECRET');
        $decoded = JWT::decode($token, new Key($key, 'HS256'));
        $uploaderId = $decoded->uid;

        $resourceModel = new ResourceModel();
        return $this->respond($resourceModel->where('uploader_id', $uploaderId)->findAll());